<a href="https://colab.research.google.com/github/lucylao/data_analytics/blob/main/Data_Wrangling_Classwork.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [5]:
book_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/BL-Flickr-Images-Book.csv')

In [6]:
# HEAD - first 5 rows
book_df.head()

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.

[5 rows x 15 columns]

In [7]:
# TAIL - last 5 rows
book_df.tail()

      Identifier  ...                                         Shelfmarks
8282     4158088  ...  British Library HMNTS|British Library HMNTS 10...
8283     4158128  ...  British Library HMNTS|British Library HMNTS 10...
8284     4159563  ...  British Library HMNTS|British Library HMNTS 19...
8285     4159587  ...  British Library HMNTS|British Library HMNTS 10...
8286     4160339  ...  British Library HMNTS|British Library HMNTS 79...

[5 rows x 15 columns]

In [9]:
# SHAPE - total number of rows and columns in an array (rows, columns)

book_df.shape

(8287, 15)

In [10]:
# columns in data frame
# features - attributes such as the columns, headers
book_df.columns

Index(['Identifier', 'Edition Statement', 'Place of Publication',
       'Date of Publication', 'Publisher', 'Title', 'Author', 'Contributors',
       'Corporate Author', 'Corporate Contributors', 'Former owner',
       'Engraver', 'Issuance type', 'Flickr URL', 'Shelfmarks'],
      dtype='object')

In [ ]:
# axis 1 = columns
# axis 0 = rows

In [12]:
columns_to_be_dropped = ['Edition Statement', 'Corporate Author', 'Corporate Contributors', 'Former owner', 'Engraver']

In [13]:
type(columns_to_be_dropped)

list

In [15]:
new_book_df = book_df.drop(columns_to_be_dropped, axis = 1)

In [17]:
new_book_df.head(6)

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.
5         481  ...    British Library HMNTS 9006.ee.10.

[6 rows x 10 columns]

In [18]:
new_book_df.shape

(8287, 10)

In [25]:
# find if data is unique

new_book_df['Identifier'].is_unique

True

In [26]:
# Use the 'Identifier' as an index instead of the index Python created

book_reindex_df = new_book_df.set_index('Identifier')

In [27]:
book_reindex_df.head()

                Place of Publication  ...                           Shelfmarks
Identifier                            ...
206                           London  ...    British Library HMNTS 12641.b.30.
216         London; Virtue & Yorston  ...    British Library HMNTS 12626.cc.2.
218                           London  ...    British Library HMNTS 12625.dd.1.
472                           London  ...  British Library HMNTS 10369.bbb.15.
480                           London  ...     British Library HMNTS 9007.d.28.

[5 rows x 9 columns]

In [28]:
book_reindex_df.tail()

           Place of Publication  ...                                         Shelfmarks
Identifier                       ...
4158088                  London  ...  British Library HMNTS|British Library HMNTS 10...
4158128                   Derby  ...  British Library HMNTS|British Library HMNTS 10...
4159563                  London  ...  British Library HMNTS|British Library HMNTS 19...
4159587     Newcastle upon Tyne  ...  British Library HMNTS|British Library HMNTS 10...
4160339                  London  ...  British Library HMNTS|British Library HMNTS 79...

[5 rows x 9 columns]

In [29]:
type(book_reindex_df)

pandas.core.frame.DataFrame

In [57]:
place_df = book_reindex_df['Place of Publication'].mode()
place_df

0    London
dtype: object

In [51]:
datebefore1900_df = book_reindex_df['Date of Publication'] > '1900'
datebefore1900_df.value_counts()

False    7496
True      791
Name: Date of Publication, dtype: int64

In [62]:
publisher_df = book_reindex_df['Publisher'].mode()
publisher_df

0    Macmillan & Co.
dtype: object

In [59]:
# is the value a number
book_reindex_df['Date of Publication'].str.isnumeric()

Identifier
206        False
216         True
218         True
472         True
480         True
           ...
4158088     True
4158128    False
4159563    False
4159587     True
4160339    False
Name: Date of Publication, Length: 8287, dtype: object

In [64]:
# find by index

book_reindex_df.iloc[206]

Place of Publication                                               London
Date of Publication                                                  1848
Publisher                                                 Richard Bentley
Title                   Rambles in the romantic regions of the Hartz M...
Author                                   Andersen, H. C. (Hans Christian)
Contributors                                  BECKWITH-LOHMEYER, Charles.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 10250.c.16.
Name: 77554, dtype: object

In [70]:
book_reindex_df.iloc[288]

Place of Publication                                               London
Date of Publication                                                  1862
Publisher                                                Hurst & Blackett
Title                   John Arnold. [A novel.] By the author of “Math...
Author                                                      ARNOLD, John.
Contributors                           WILSON, William - Minister at Etal
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 12635.cc.1.
Name: 119514, dtype: object

In [79]:
# fix 'date of publication' value
regex = r'^(\d{4})'
book_reindex_df['Date of Publication'] = book_reindex_df['Date of Publication'].str.extract(regex, expand = False)
book_reindex_df['Date of Publication']

Identifier
206        1879
216        1868
218        1869
472        1851
480        1857
           ...
4158088    1838
4158128    1831
4159563     NaN
4159587    1834
4160339    1834
Name: Date of Publication, Length: 8287, dtype: object

In [80]:
book_reindex_df.head()

                Place of Publication  ...                           Shelfmarks
Identifier                            ...
206                           London  ...    British Library HMNTS 12641.b.30.
216         London; Virtue & Yorston  ...    British Library HMNTS 12626.cc.2.
218                           London  ...    British Library HMNTS 12625.dd.1.
472                           London  ...  British Library HMNTS 10369.bbb.15.
480                           London  ...     British Library HMNTS 9007.d.28.

[5 rows x 9 columns]

In [83]:
book_reindex_df['Date of Publication'].str.isnumeric()

Identifier
206        True
216        True
218        True
472        True
480        True
           ...
4158088    True
4158128    True
4159563     NaN
4159587    True
4160339    True
Name: Date of Publication, Length: 8287, dtype: object

In [84]:
book_reindex_df['Date of Publication'].dtype

dtype('O')

## Missing Data

In [88]:
property_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv')
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [89]:
property_df.shape

(9, 7)

In [94]:
# display NaN values in 'ST_NUM' column
property_df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [101]:
# counts the number of rows in column
property_df['ST_NUM'].isnull().count()

9

In [102]:
# convert the wrong value into missing value

property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [103]:
property_df['NUM_BATH'] = pd.to_numeric(property_df['NUM_BATH'], errors = 'coerce')
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0    BERKELEY           12            1       NaN   700
4          NaN   203.0    BERKELEY            Y            3       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN            2       NaN   950
7  100008000.0   213.0     TREMONT            Y            1       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

In [105]:
# only dropped rows with NaN not 'na' or empty spaces
new_property_df = property_df.dropna()
new_property_df

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
8  100009000.0   215.0    TREMONT            Y           na       2.0  1800

In [118]:
missing_values = ['-','--','na','n/a','NA']

property_na_fix_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv', na_values = missing_values)
property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [119]:
# fixing missing values

property_na_fix_df.NUM_BEDROOMS.unique

<bound method Series.unique of 0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64>

In [120]:
property_na_fix_df['NUM_BEDROOMS'].is_unique

False

In [121]:
# forcing PANDA to convert the value

property_na_fix_df['NUM_BATH'] = pd.to_numeric(df['NUM_BATH'], errors = 'coerce')
property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0       1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN       1.0   850.0
3  100004000.0   201.0    BERKELEY           12           1.0       NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0       2.0  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN       1.0   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0       NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0       1.0     NaN
8  100009000.0   215.0     TREMONT            Y           NaN       2.0  1800.0

In [123]:
property_na_fix_df['SQ_FT']

0    1000.0
1       NaN
2     850.0
3     700.0
4    1600.0
5     800.0
6     950.0
7       NaN
8    1800.0
Name: SQ_FT, dtype: float64

In [124]:
# add property type to dataframe

property_na_fix_df['Prop_Type'] = np.where((property_na_fix_df['SQ_FT'] > 1000), 'BIG', 'SMALL')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  Prop_Type
0  100001000.0   104.0      PUTNAM  ...      1.0  1000.0      SMALL
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN      SMALL
2  100003000.0     NaN   LEXINGTON  ...      1.0   850.0      SMALL
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0      SMALL
4          NaN   203.0    BERKELEY  ...      2.0  1600.0        BIG
5  100006000.0   207.0    BERKELEY  ...      1.0   800.0      SMALL
6  100007000.0     NaN  WASHINGTON  ...      NaN   950.0      SMALL
7  100008000.0   213.0     TREMONT  ...      1.0     NaN      SMALL
8  100009000.0   215.0     TREMONT  ...      2.0  1800.0        BIG

[9 rows x 8 columns]

In [126]:
# replace null value in property type with unknown

property_na_fix_df['Prop_Type'] = np.where((property_na_fix_df['SQ_FT'].isna() == False), property_na_fix_df['SQ_FT'], 'Unknown')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  Prop_Type
0  100001000.0   104.0      PUTNAM  ...      1.0  1000.0     1000.0
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN    Unknown
2  100003000.0     NaN   LEXINGTON  ...      1.0   850.0      850.0
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0      700.0
4          NaN   203.0    BERKELEY  ...      2.0  1600.0     1600.0
5  100006000.0   207.0    BERKELEY  ...      1.0   800.0      800.0
6  100007000.0     NaN  WASHINGTON  ...      NaN   950.0      950.0
7  100008000.0   213.0     TREMONT  ...      1.0     NaN    Unknown
8  100009000.0   215.0     TREMONT  ...      2.0  1800.0     1800.0

[9 rows x 8 columns]

In [127]:
# fill in a value
new_property_df
new_property_df_BR = property_df['NUM_BEDROOMS'].fillna(5, inplace = False)
new_property_df

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
8  100009000.0   215.0    TREMONT            Y           na       2.0  1800